bd.org
#+include: back.org
#+TITLE: 字节安卓客户端面试
* 字节安卓客户端
** DONE 一面 ~ 1 hour
- State "DONE"       from              [2022-03-04 Fri 14:00]
*** 项目
**** joblib
1. 协程相关
2. 为什么写joblib
**** mjsoul_ws
主要负责网络部分
1. 你是怎么实现这部分的？
websocket + protobuf

*** 基础知识
**** 数据结构
1. 你怎么实现HashMap？数组+链表
2. 如果HashMap中链表太长，你怎么优化性能？ 链表换成树结构。
3. 简述堆的结构
4. 往堆里插入数据的流程。

**** CPP基础
1. 四种智能指针

**** OS
1. 简述进程
2. 简述线程
3. 二者区别
4. 为什么要用线程
5. 保证线程安全的方法？
    我说了加锁、信号量。面试官对这个回答不太满意。
6. 什么是信号量？
7. 说一下两个线程同时对一个变量i进行自增和自减的操作，i的值有哪几种可能？

**** 计网
1. 简述TCP/UDP
2. 使用TCP/UDP的应用层协议举例
3. 你觉得我们视频面试用的是TCP还是UDP？ UDP
4. 你觉得如果我们用文字面试，是TCP还是UDP？ TCP
5. TCP四次挥手
6. 为什么最后一次挥手要等待2MSL？ 一共两点。
7. HTTP和HTTPS的区别（HTTPS=HTTP+SSL/TLS）
8. HTTPS连接过程
9. 你觉得为什么https连接建立之后，传输数据用的是对称加密，而不是非对称加密？
10. http请求格式
11. 状态码
12. keep-alive是什么？长连接是什么？

*** 其它
1. 什么时候可以入职？能实习多久？
2. 你没学过Java/Kotlin，那你打算入职后怎么学习呢？（具体的）

*** 算法题
1. LC103 思路BFS+deque


