bd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-04 Fri 15:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>字节安卓客户端面试</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="于承业" />
</head>
<body>
<div id="content">
<h1 class="title">字节安卓客户端面试</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org63c21ae">1. 字节安卓客户端</a>
<ul>
<li><a href="#org5d9ce75">1.1. <span class="done DONE">DONE</span> 一面 ~ 1 hour</a>
<ul>
<li><a href="#orge3369a7">1.1.1. 项目</a></li>
<li><a href="#org66cd1f0">1.1.2. 基础知识</a></li>
<li><a href="#orgc834ad7">1.1.3. 其它</a></li>
<li><a href="#org9063686">1.1.4. 算法题</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="./index.html">Back to index</a>
</p>
<div id="outline-container-org63c21ae" class="outline-2">
<h2 id="org63c21ae"><span class="section-number-2">1</span> 字节安卓客户端</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5d9ce75" class="outline-3">
<h3 id="org5d9ce75"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> 一面 ~ 1 hour</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>State "DONE"       from              <span class="timestamp-wrapper"><span class="timestamp">[2022-03-04 Fri 14:00]</span></span></li>
</ul>
</div>
<div id="outline-container-orge3369a7" class="outline-4">
<h4 id="orge3369a7"><span class="section-number-4">1.1.1</span> 项目</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org5ae2268"></a>joblib<br />
<div class="outline-text-5" id="text-1-1-1-1">
<ol class="org-ol">
<li>协程相关</li>
<li>为什么写joblib</li>
</ol>
</div>
</li>
<li><a id="orgcce22eb"></a>mjsoul<sub>ws</sub><br />
<div class="outline-text-5" id="text-1-1-1-2">
<p>
主要负责网络部分
</p>
<ol class="org-ol">
<li>你是怎么实现这部分的？</li>
</ol>
<p>
websocket + protobuf
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org66cd1f0" class="outline-4">
<h4 id="org66cd1f0"><span class="section-number-4">1.1.2</span> 基础知识</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org9ca73f2"></a>数据结构<br />
<div class="outline-text-5" id="text-1-1-2-1">
<ol class="org-ol">
<li>你怎么实现HashMap？数组+链表</li>
<li>如果HashMap中链表太长，你怎么优化性能？ 链表换成树结构。</li>
<li>简述堆的结构</li>
<li>往堆里插入数据的流程。</li>
</ol>
</div>
</li>

<li><a id="orgb1936a8"></a>CPP基础<br />
<div class="outline-text-5" id="text-1-1-2-2">
<ol class="org-ol">
<li>四种智能指针</li>
</ol>
</div>
</li>

<li><a id="org12874c3"></a>OS<br />
<div class="outline-text-5" id="text-1-1-2-3">
<ol class="org-ol">
<li>简述进程</li>
<li>简述线程</li>
<li>二者区别</li>
<li>为什么要用线程</li>
<li>保证线程安全的方法？
我说了加锁、信号量。面试官对这个回答不太满意。</li>
<li>什么是信号量？</li>
<li>说一下两个线程同时对一个变量i进行自增和自减的操作，i的值有哪几种可能？</li>
</ol>
</div>
</li>

<li><a id="org62a7b70"></a>计网<br />
<div class="outline-text-5" id="text-1-1-2-4">
<ol class="org-ol">
<li>简述TCP/UDP</li>
<li>使用TCP/UDP的应用层协议举例</li>
<li>你觉得我们视频面试用的是TCP还是UDP？ UDP</li>
<li>你觉得如果我们用文字面试，是TCP还是UDP？ TCP</li>
<li>TCP四次挥手</li>
<li>为什么最后一次挥手要等待2MSL？ 一共两点。</li>
<li>HTTP和HTTPS的区别（HTTPS=HTTP+SSL/TLS）</li>
<li>HTTPS连接过程</li>
<li>你觉得为什么https连接建立之后，传输数据用的是对称加密，而不是非对称加密？</li>
<li>http请求格式</li>
<li>状态码</li>
<li>keep-alive是什么？长连接是什么？</li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgc834ad7" class="outline-4">
<h4 id="orgc834ad7"><span class="section-number-4">1.1.3</span> 其它</h4>
<div class="outline-text-4" id="text-1-1-3">
<ol class="org-ol">
<li>什么时候可以入职？能实习多久？</li>
<li>你没学过Java/Kotlin，那你打算入职后怎么学习呢？（具体的）</li>
</ol>
</div>
</div>

<div id="outline-container-org9063686" class="outline-4">
<h4 id="org9063686"><span class="section-number-4">1.1.4</span> 算法题</h4>
<div class="outline-text-4" id="text-1-1-4">
<ol class="org-ol">
<li>LC103 思路BFS+deque</li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 于承业</p>
<p class="date">Created: 2022-03-04 Fri 15:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
